In [1]:
import pandas as pd
import numpy as np

In [5]:
ubicacion = "./datos/exam_student.csv"
df = pd.read_csv(ubicacion, header=None)
df.head(10)

In [3]:
encabezado = df.iloc[0].tolist()
df.columns = encabezado

In [4]:
df = df.drop(df.index[0])
df.columns = encabezado
df = df.drop(df.columns[0], axis=1)

In [279]:
df.describe()

,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
count,30641,28801,28796,30641,28811,29451,30010,29737,29069,27507,29686,30641,30641,30641
unique,2,5,6,2,2,4,3,2,8,2,3,95,90,93
top,female,group C,some college,standard,none,married,sometimes,yes,1,school_bus,5 - 10,64,65,67
freq,15424,9212,6633,19905,18856,16844,15213,19082,8217,16145,16246,890,1001,816

In [280]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30641 entries, 1 to 30641
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Gender               30641 non-null  object
 1   EthnicGroup          28801 non-null  object
 2   ParentEduc           28796 non-null  object
 3   LunchType            30641 non-null  object
 4   TestPrep             28811 non-null  object
 5   ParentMaritalStatus  29451 non-null  object
 6   PracticeSport        30010 non-null  object
 7   IsFirstChild         29737 non-null  object
 8   NrSiblings           29069 non-null  object
 9   TransportMeans       27507 non-null  object
 10  WklyStudyHours       29686 non-null  object
 11  MathScore            30641 non-null  object
 12  ReadingScore         30641 non-null  object
 13  WritingScore         30641 non-null  object
dtypes: object(14)
memory usage: 3.3+ MB

In [281]:
df.isnull().sum()

Gender                    0
EthnicGroup            1840
ParentEduc             1845
LunchType                 0
TestPrep               1830
ParentMaritalStatus    1190
PracticeSport           631
IsFirstChild            904
NrSiblings             1572
TransportMeans         3134
WklyStudyHours          955
MathScore                 0
ReadingScore              0
WritingScore              0
dtype: int64

In [282]:
df =df.dropna(axis=0)

In [283]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 19243 entries, 3 to 30641
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Gender               19243 non-null  object
 1   EthnicGroup          19243 non-null  object
 2   ParentEduc           19243 non-null  object
 3   LunchType            19243 non-null  object
 4   TestPrep             19243 non-null  object
 5   ParentMaritalStatus  19243 non-null  object
 6   PracticeSport        19243 non-null  object
 7   IsFirstChild         19243 non-null  object
 8   NrSiblings           19243 non-null  object
 9   TransportMeans       19243 non-null  object
 10  WklyStudyHours       19243 non-null  object
 11  MathScore            19243 non-null  object
 12  ReadingScore         19243 non-null  object
 13  WritingScore         19243 non-null  object
dtypes: object(14)
memory usage: 2.2+ MB

In [284]:
df.dtypes

Gender                 object
EthnicGroup            object
ParentEduc             object
LunchType              object
TestPrep               object
ParentMaritalStatus    object
PracticeSport          object
IsFirstChild           object
NrSiblings             object
TransportMeans         object
WklyStudyHours         object
MathScore              object
ReadingScore           object
WritingScore           object
dtype: object

In [285]:
df[["NrSiblings", "MathScore","ReadingScore","WritingScore"]] = df[["NrSiblings", "MathScore","ReadingScore","WritingScore"]].astype("int")
df[["Gender",	"EthnicGroup",	"ParentEduc",	"LunchType",	"TestPrep",	"ParentMaritalStatus",	"PracticeSport",	"IsFirstChild" ,"TransportMeans","WklyStudyHours"]] = df[["Gender",	"EthnicGroup",	"ParentEduc",	"LunchType",	"TestPrep",	"ParentMaritalStatus",	"PracticeSport",	"IsFirstChild" ,"TransportMeans", "WklyStudyHours"]].astype("string")

In [286]:
df.dtypes

Gender                 string[python]
EthnicGroup            string[python]
ParentEduc             string[python]
LunchType              string[python]
TestPrep               string[python]
ParentMaritalStatus    string[python]
PracticeSport          string[python]
IsFirstChild           string[python]
NrSiblings                      int32
TransportMeans         string[python]
WklyStudyHours         string[python]
MathScore                       int32
ReadingScore                    int32
WritingScore                    int32
dtype: object

In [287]:
df.head()

,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
3,female,group B,master's degree,standard,none,single,sometimes,yes,4,school_bus,< 5,87,93,91
5,male,group C,some college,standard,none,married,sometimes,yes,0,school_bus,5 - 10,76,78,75
6,female,group B,associate's degree,standard,none,married,regularly,yes,1,school_bus,5 - 10,73,84,79
7,female,group B,some college,standard,completed,widowed,never,no,1,private,5 - 10,85,93,89
8,male,group B,some college,free/reduced,none,married,sometimes,yes,1,private,> 10,41,43,39

In [288]:
df['MathScore'] = df['MathScore']/df['MathScore'].max()
df['ReadingScore'] = df['ReadingScore']/df['ReadingScore'].max()
df['WritingScore'] = df['WritingScore']/df['WritingScore'].max()
df.head()

,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
3,female,group B,master's degree,standard,none,single,sometimes,yes,4,school_bus,< 5,0.87,0.93,0.91
5,male,group C,some college,standard,none,married,sometimes,yes,0,school_bus,5 - 10,0.76,0.78,0.75
6,female,group B,associate's degree,standard,none,married,regularly,yes,1,school_bus,5 - 10,0.73,0.84,0.79
7,female,group B,some college,standard,completed,widowed,never,no,1,private,5 - 10,0.85,0.93,0.89
8,male,group B,some college,free/reduced,none,married,sometimes,yes,1,private,> 10,0.41,0.43,0.39

In [289]:
contenedoresMat = np.linspace(min(df["MathScore"]), max(df["MathScore"]), 6)
contenedoresRead = np.linspace(min(df["ReadingScore"]), max(df["ReadingScore"]), 6)
contenedoresWrite = np.linspace(min(df["WritingScore"]), max(df["WritingScore"]), 6)

In [290]:
nombres_de_grupo = ['F', 'D','C','B','A']
df['MathScore-group'] = pd.cut(df['MathScore'], contenedoresMat, labels=nombres_de_grupo, include_lowest=True )
df['ReadingScore-group'] = pd.cut(df['ReadingScore'], contenedoresRead, labels=nombres_de_grupo, include_lowest=True )
df['WritingScore-group'] = pd.cut(df['WritingScore'], contenedoresWrite, labels=nombres_de_grupo, include_lowest=True )

In [291]:
df.head()

,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore,MathScore-group,ReadingScore-group,WritingScore-group
3,female,group B,master's degree,standard,none,single,sometimes,yes,4,school_bus,< 5,0.87,0.93,0.91,A,A,A
5,male,group C,some college,standard,none,married,sometimes,yes,0,school_bus,5 - 10,0.76,0.78,0.75,B,B,B
6,female,group B,associate's degree,standard,none,married,regularly,yes,1,school_bus,5 - 10,0.73,0.84,0.79,B,A,B
7,female,group B,some college,standard,completed,widowed,never,no,1,private,5 - 10,0.85,0.93,0.89,A,A,A
8,male,group B,some college,free/reduced,none,married,sometimes,yes,1,private,> 10,0.41,0.43,0.39,C,D,D